'''
Дано положительное действительное число X. Выведите его дробную часть.
'''

a = float(input("Enter the first number: "))
x = a - int(a)
print(x)

'''
это я не сам в итоге но понимаю как
'''