'''
Дано натуральное число. Выведите его последнюю цифру.
'''
a = int(input('введите'))
n = a % 10
print(n)