'''
Дано положительное действительное число X. Выведите его первую цифру после десятичной точки.
'''

print(str(float(input()) % 1)[2])

'''
это я не сам в итоге но понимаю как
'''